kubos/kubos/hal/kubos-hal-stm32f4/source/i2c.c
/*
 * KubOS HAL
 * Copyright (C) 2016 Kubos Corporation
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */
 /**
   * @defgroup I2C STM32F4 HAL I2C Interface
   * @addtogroup I2C
   * @{
   */

#if (defined YOTTA_CFG_HARDWARE_I2C) && (YOTTA_CFG_HARDWARE_I2C_COUNT > 0)
#include "kubos-hal/i2c.h"
#include "kubos-hal-stm32f4/i2c.h"
#include "kubos-hal/gpio.h"
#include "FreeRTOS.h"
#include "task.h"
#include "stm32f4xx.h"

/** Time out value used when checking if bit flags are set */
#define FLAG_CHECK_TIMEOUT 200

/**
 * Fetches i2c bus data structure
 * @param num [in] i2c bus num to fetch
 * @return hal_i2c_handle* pointer to data structure
 */
static hal_i2c_handle * hal_i2c_get_handle(KI2CNum num);

/**
 * Initializes i2c bus structure with data needed to setup hardware
 * @param i2c [in] higher level hal i2c data
 * @return hal_i2c_handle* NULL if bad bus num, otherwise data ready for dev setup
 */
static hal_i2c_handle * hal_i2c_device_init(KI2C * i2c);

/**
 * Initializes the I2C according to the specified parameters
 * in the I2C_InitTypeDef and create the associated handle.
 *
 * @note Derived from STM32CubeF4's HAL_I2C_INIT
 * @param handle [out] pointer to hal_i2c_handle containing config information
 * @return KI2CStatus I2C_OK if success, otherwise a specific error flag
 */
static KI2CStatus hal_i2c_hw_init(hal_i2c_handle * handle);

/**
 * Low level I2C hardware setup
 * @note Derived from STM32CubeF4's HAL_I2C_MspInit
 * @param handle [in] pointer to hal_i2c_handle containing config information
 */
static void hal_i2c_msp_init(hal_i2c_handle * handle);

/**
 * I2C hardware cleanup and disabling
 * @param handle [in] pointer to hal_i2c_handle containing config information
 */
static void hal_i2c_terminate(hal_i2c_handle * handle);

/**
 * Checks for the addr flag to be set, with builtin timeout
 * @note Derived from STM32CubeF4's I2C_WaitOnMasterAddressFlagUntilTimeout
 * @param handle [in] Pointer to STM32CubeF4 HAL defined structure for I2C data
 * @param flag [in] I2C flag to check
 * @return KI2CStatus I2C_OK if success, otherwise a specific error flag
 */
static KI2CStatus hal_i2c_check_addr_timeout(I2C_HandleTypeDef * handle, uint32_t flag);

/**
 * Checks for special conditions based on the flag
 * @param handle [in] Pointer to STM32CubeF4 HAL defined structure for I2C data
 * @param flag [out] I2C Flag that should be checked
 * @return KI2CStatus I2C_OK if no special conditions found, specific error otherwise
 */
static KI2CStatus hal_i2c_check_flag_special(I2C_HandleTypeDef * handle, uint32_t flag);

/**
 * Checks specified flag for desired state, with builtin timeout
 * @note Derived from STM32CubeF4's I2C_WaitOnFlagUntilTimeout
 * @param handle [in] Pointer to STM32CubeF4 HAL defined structure for I2C data
 * @param flag [in] I2C Flag that should be checked
 * @param status [in] Indicates whether to check for flag state of SET or RESET
 * @return KI2CStatus I2C_OK if flag is set to desired value within timout, otherwise I2C_TIMEOUT
 */
static KI2CStatus hal_i2c_check_flag_timeout(I2C_HandleTypeDef * handle, uint32_t flag, uint16_t status);

/**
 * Checks for btf flag to reset, with builtin timeout
 * @note Derived from STM32CubeF4's I2C_WaitOnBTFFlagUntilTimeout
 * @param handle [in] Pointer to STM32CubeF4 HAL defined structure for I2C data
 * @return KI2CStatus I2C_OK if btf is reset within timeout, otherwise specific error
 */
static KI2CStatus hal_i2c_check_btf_timeout(I2C_HandleTypeDef * handle);

/**
 * Checks for txe flag to reset, with builtin timeout
 * @note Derived from STM32CubeF4's I2C_WaitOnBTFFlagUntilTimeout
 * @param handle [in] Pointer to STM32CubeF4 HAL defined structure for I2C data
 * @return KI2CStatus I2C_OK if txe is reset within timeout, otherwise specific error
 */
static KI2CStatus hal_i2c_check_txe_timeout(I2C_HandleTypeDef * handle);

/**
 * Master sends slave address for read request
 * @note Derived from STM32CubeF4's I2C_MasterRequestRead
 * @param hal_handle [in] Pointer to STM32CubeF4 HAL defined structure for I2C data
 * @param addr [in] target slave address
 * @return KI2CStatus I2C_OK if success, otherwise specific error
 */
static KI2CStatus hal_i2c_master_request_read(I2C_HandleTypeDef * hal_handle, uint16_t addr);

/**
 * Sends initial receive sequence based on length of data expected
 * @note Partly derived from STM32CubeF4's HAL_I2C_Master_Receive
 * @param hal_handle [in] Pointer to STM32CubeF4 HAL defined structure for I2C data
 * @param addr [in] target slave address
 * @param len [in] length of data expected to be received
 * @return KI2CStatus I2C_OK if success, otherwise specific error
 */
static KI2CStatus hal_i2c_master_setup_read(I2C_HandleTypeDef * hal_handle, uint16_t addr, int len);

/**
 * Master sends slave address for write request
 * @note Derived from STM32CubeF4's I2C_MasterRequestWrite
 * @param hal_handle [in] Pointer to STM32CubeF4 HAL defined structure for I2C data
 * @param addr [in] target slave address
 * @return KI2CStatus I2C_OK if success, otherwise specific error
 */
static KI2CStatus hal_i2c_master_request_write(I2C_HandleTypeDef * hal_handle, uint16_t addr);

/**
 * Sends initial transmit sequence
 * @note Derived from STM32CubeF4's HAL_I2C_Master_Transmit
 * @param hal_handle [in] Pointer to STM32CubeF4 HAL defined structure for I2C data
 * @param addr [in] target slave address
 * @return KI2CStatus I2C_OK if success, otherwise specific error
 */
static KI2CStatus hal_i2c_master_setup_write(I2C_HandleTypeDef * hal_handle, uint16_t addr);

/**
 * Static array of i2c bus handles
 */
static hal_i2c_handle hal_i2c_bus[K_NUM_I2CS];

/* Functions implemented from Kubos-HAL interface */

/**
 * Setup and enable i2c bus
 * @param i2c_num [in] i2c bus to initialize
 * @return KI2CStatus I2C_OK if success, otherwise a specific error flag
 */
KI2CStatus kprv_i2c_dev_init(KI2CNum i2c_num)
{
    KI2C * i2c = kprv_i2c_get(i2c_num);
    if(i2c == NULL)
    {
        return I2C_ERROR;
    }

    //Only I2C master processing is currently supported
    if(i2c->conf.role != K_MASTER)
    {
        return I2C_ERROR;
    }

    hal_i2c_handle * handle = hal_i2c_device_init(i2c);
    if(handle == NULL)
    {
        return I2C_ERROR_NULL_HANDLE;
    }

    return hal_i2c_hw_init(handle);
}

/**
 * i2c hardware cleanup and disabling
 * @param i2c [in] bus num to terminate
 * @return KI2CStatus I2C_OK if success, otherwise a specific error flag
 */
KI2CStatus kprv_i2c_dev_terminate(KI2CNum i2c)
{
    hal_i2c_handle * handle = hal_i2c_get_handle(i2c);
    if (handle == NULL)
    {
        return I2C_ERROR_NULL_HANDLE;
    }

    hal_i2c_terminate(handle);

    return I2C_OK;
}

/**
 * Write data over i2c bus as master
 * @param i2c [in] i2c bus to write to
 * @param addr [in] i2c address to write to
 * @param ptr [in] pointer to data buffer
 * @param len [in] length of data to write
 * @return KI2CStatus I2C_OK on success, otherwise failure
 */
KI2CStatus kprv_i2c_master_write(KI2CNum i2c, uint16_t addr, uint8_t *ptr, int len)
{
    KI2CStatus ret = I2C_OK;

