kubos/kubos/hal/kubos-hal-stm32f4/source/i2c.c
    hal_i2c_handle * handle = hal_i2c_get_handle(i2c);
    if (handle == NULL)
    {
        return I2C_ERROR_NULL_HANDLE;
    }

    I2C_HandleTypeDef * hal_handle = &(handle->hal_handle);
    if ((ret = hal_i2c_master_setup_write(hal_handle, addr)) != I2C_OK)
    {
        return ret;
    }
    while (len > 0)
    {
        /* Wait until TXE is set */
        ret = hal_i2c_check_txe_timeout(hal_handle);
        if (ret != I2C_OK)
        {
            /* Generate Stop */
            hal_handle->Instance->CR1 |= I2C_CR1_STOP;
            return ret;
        }

        /* Write data */
        hal_handle->Instance->DR = (*ptr++);
        len--;

        if ((__HAL_I2C_GET_FLAG(hal_handle, I2C_FLAG_BTF) == SET) && (len != 0))
        {
            /* Write data */
            hal_handle->Instance->DR = (*ptr++);
            len--;
        }

        /* Wait for BTF flag */
        ret = hal_i2c_check_btf_timeout(hal_handle);
        if (ret != I2C_OK)
        {
            /* Generate Stop */
            hal_handle->Instance->CR1 |= I2C_CR1_STOP;
            return ret;
        }
    }

    /* Generate Stop */
    hal_handle->Instance->CR1 |= I2C_CR1_STOP;

    /* clock stretching? */
    if ((ret = hal_i2c_check_flag_timeout(hal_handle, I2C_FLAG_BUSY, SET)) != I2C_OK)
    {
        return ret;
    }

    return ret;
}

/**
 * Read data over i2c bus as master
 * @param i2c i2c bus to read from
 * @param addr i2c address to write to
 * @param ptr pointer to data buffer
 * @param len length of data to read
 * @return KI2CStatus I2C_OK on success, otherwise failure
 */
KI2CStatus kprv_i2c_master_read(KI2CNum i2c, uint16_t addr, uint8_t *ptr, int len)
{
    KI2CStatus ret = I2C_OK;
    hal_i2c_handle * handle = hal_i2c_get_handle(i2c);
    if (handle == NULL)
    {
        return I2C_ERROR_NULL_HANDLE;
    }

    I2C_HandleTypeDef * hal_handle = &(handle->hal_handle);
    if ((ret = hal_i2c_master_setup_read(hal_handle, addr, len)) != I2C_OK)
    {
        return ret;
    }

    /* Data reading process */
    while (len > 0)
    {
        if (len == 1)
        {

            /* Wait for RXNE */
            if ((ret = hal_i2c_check_flag_timeout(hal_handle, I2C_FLAG_RXNE, SET)) != I2C_OK)
            {
                return ret;
            }

            /* clock stretching? */
            if ((ret = hal_i2c_check_flag_timeout(hal_handle, I2C_FLAG_BUSY, SET)) != I2C_OK)
            {
                return ret;
            }

            /* Read data1 */
            uint8_t val = hal_handle->Instance->DR;
            (*ptr++) = val;
            len--;
        }
        else if (len == 2)
        {
            /* Wait for BTF */
            if ((ret = hal_i2c_check_btf_timeout(hal_handle)) != I2C_OK)
            {
                return ret;
            }

            /* Generate Stop */
            hal_handle->Instance->CR1 |= I2C_CR1_STOP;

            /* Read data1 */
            uint8_t val = hal_handle->Instance->DR;
            (*ptr++) = val;
            len--;

            /* Read data2 */
            val = hal_handle->Instance->DR;
            (*ptr++) = val;
            len--;
        }
        else if (len == 3)
        {
            /* Wait for BTF to be set */
            if ((ret = hal_i2c_check_btf_timeout(hal_handle)) != I2C_OK)
            {
                return ret;
            }

            /* Disable Acknowledge */
            hal_handle->Instance->CR1 &= ~I2C_CR1_ACK;

            /* Read data */
            uint8_t val = hal_handle->Instance->DR;
            (*ptr++) = val;
            len--;

            /* Wait for BTF to be set */
            if ((ret = hal_i2c_check_btf_timeout(hal_handle)) != I2C_OK)
            {
                return ret;
            }

            /* Generate Stop */
            hal_handle->Instance->CR1 |= I2C_CR1_STOP;

            /* Read data */
            val = hal_handle->Instance->DR;
            (*ptr++) = val;
            len--;

            /* Read data */
            val = hal_handle->Instance->DR;
            (*ptr++) = val;
            len--;
        }
        else
        {

            /* Wait for BTF to be set */
            if ((ret = hal_i2c_check_btf_timeout(hal_handle)) != I2C_OK)
            {
                return ret;
            }

            uint8_t val = hal_handle->Instance->DR;
            (*ptr++) = val;
            len--;
        }
    }
    return ret;
}

/* Private hal functions */

static hal_i2c_handle* hal_i2c_get_handle(KI2CNum num)
{
    //Validate I2C number
    if(num < 0 || num > K_NUM_I2CS)
    {
        return 0;
    }

    return &hal_i2c_bus[num-1];
}

static hal_i2c_handle * hal_i2c_device_init(KI2C * i2c)
{
    hal_i2c_handle * handle = NULL;
    if (i2c != NULL)
    {
        handle = hal_i2c_get_handle(i2c->bus_num);
        if (handle != NULL)
        {
            KI2CConf config = i2c->conf;
            handle->ki2c = i2c;

            switch(config.addressing_mode)
            {
            	case K_ADDRESSINGMODE_10BIT:
            		handle->hal_handle.Init.AddressingMode = K_ADDRESSINGMODE_10BIT;
            		break;
            	case K_ADDRESSINGMODE_7BIT:
            	default:
            		handle->hal_handle.Init.AddressingMode = K_ADDRESSINGMODE_7BIT;
            		break;
            }

            if(config.clock_speed < 0)
            {
            	handle->hal_handle.Init.ClockSpeed = 0;
            }
            else if(config.clock_speed > 400000)
            {
            	handle->hal_handle.Init.ClockSpeed = 400000;
            }
            else
            {
            	handle->hal_handle.Init.ClockSpeed      = config.clock_speed;
            }

            handle->hal_handle.Init.DualAddressMode = I2C_DUALADDRESS_DISABLE;
            handle->hal_handle.Init.DutyCycle       = I2C_DUTYCYCLE_2;
            handle->hal_handle.Init.GeneralCallMode = I2C_GENERALCALL_DISABLE;
            handle->hal_handle.Init.NoStretchMode   = I2C_NOSTRETCH_DISABLE;
            handle->hal_handle.Init.OwnAddress1     = 0x00;
            handle->hal_handle.Init.OwnAddress2     = 0x00;

            switch(i2c->bus_num)
            {
#ifdef YOTTA_CFG_HARDWARE_I2C_I2C1
                case K_I2C1:
                {
                    handle->hal_handle.Instance = I2C1;
                    /* gpio pins */
                    handle->pins.scl = STM32F4_PIN_MASK(YOTTA_CFG_HARDWARE_I2C_I2C1_SCL_PIN);
                    handle->pins.scl_mode = YOTTA_CFG_HARDWARE_I2C_I2C1_SCL_MODE;
                    handle->pins.scl_pullup = YOTTA_CFG_HARDWARE_I2C_I2C1_SCL_PULLUP;
                    handle->pins.scl_speed = YOTTA_CFG_HARDWARE_I2C_I2C1_SCL_SPEED;
                    handle->pins.sda = STM32F4_PIN_MASK(YOTTA_CFG_HARDWARE_I2C_I2C1_SDA_PIN);
                    handle->pins.sda_mode = YOTTA_CFG_HARDWARE_I2C_I2C1_SDA_MODE;
                    handle->pins.sda_pullup = YOTTA_CFG_HARDWARE_I2C_I2C1_SDA_PULLUP;
                    handle->pins.sda_speed = YOTTA_CFG_HARDWARE_I2C_I2C1_SDA_SPEED;
                    handle->pins.alt = YOTTA_CFG_HARDWARE_I2C_I2C1_ALT;
                    handle->pins.gpio_port = STM32F4_PIN_GPIO(YOTTA_CFG_HARDWARE_I2C_I2C1_SCL_PIN);
                    handle->pins.ev_irqn = I2C1_EV_IRQn;
                    handle->pins.er_irqn = I2C1_ER_IRQn;
                    break;
                }
#endif
#ifdef YOTTA_CFG_HARDWARE_I2C_I2C2
                case K_I2C2:
                {
                    handle->hal_handle.Instance = I2C2;
                    /* gpio pins */
                    handle->pins.scl = STM32F4_PIN_MASK(YOTTA_CFG_HARDWARE_I2C_I2C2_SCL_PIN);
                    handle->pins.scl_mode = YOTTA_CFG_HARDWARE_I2C_I2C2_SCL_MODE;
                    handle->pins.scl_pullup = YOTTA_CFG_HARDWARE_I2C_I2C2_SCL_PULLUP;
                    handle->pins.scl_speed = YOTTA_CFG_HARDWARE_I2C_I2C2_SCL_SPEED;
                    handle->pins.sda = STM32F4_PIN_MASK(YOTTA_CFG_HARDWARE_I2C_I2C2_SDA_PIN);
                    handle->pins.sda_mode = YOTTA_CFG_HARDWARE_I2C_I2C2_SDA_MODE;
                    handle->pins.sda_pullup = YOTTA_CFG_HARDWARE_I2C_I2C2_SDA_PULLUP;
                    handle->pins.sda_speed = YOTTA_CFG_HARDWARE_I2C_I2C2_SDA_SPEED;
                    handle->pins.alt = YOTTA_CFG_HARDWARE_I2C_I2C2_ALT;
                    handle->pins.gpio_port = STM32F4_PIN_GPIO(YOTTA_CFG_HARDWARE_I2C_I2C2_SCL_PIN);
                    handle->pins.ev_irqn = I2C2_EV_IRQn;
                    handle->pins.er_irqn = I2C2_ER_IRQn;
                    break;
                }
#endif
#ifdef YOTTA_CFG_HARDWARE_I2C_I2C3
                case K_I2C3:
                {
                    handle->hal_handle.Instance = I2C3;
                    /* gpio pins */
                    handle->pins.scl = STM32F4_PIN_MASK(YOTTA_CFG_HARDWARE_I2C_I2C3_SCL_PIN);
                    handle->pins.scl_mode = YOTTA_CFG_HARDWARE_I2C_I2C3_SCL_MODE;
                    handle->pins.scl_pullup = YOTTA_CFG_HARDWARE_I2C_I2C3_SCL_PULLUP;
                    handle->pins.scl_speed = YOTTA_CFG_HARDWARE_I2C_I2C3_SCL_SPEED;
                    handle->pins.sda = STM32F4_PIN_MASK(YOTTA_CFG_HARDWARE_I2C_I2C3_SDA_PIN);
                    handle->pins.sda_mode = YOTTA_CFG_HARDWARE_I2C_I2C3_SDA_MODE;
                    handle->pins.sda_pullup = YOTTA_CFG_HARDWARE_I2C_I2C3_SDA_PULLUP;
                    handle->pins.sda_speed = YOTTA_CFG_HARDWARE_I2C_I2C3_SDA_SPEED;
                    handle->pins.alt = YOTTA_CFG_HARDWARE_I2C_I2C3_ALT;
                    handle->pins.gpio_port = STM32F4_PIN_GPIO(YOTTA_CFG_HARDWARE_I2C_I2C3_SCL_PIN);
                    handle->pins.ev_irqn = I2C3_EV_IRQn;
                    handle->pins.er_irqn = I2C3_ER_IRQn;
                    break;
                }
#endif
                default:
                {
                    handle = NULL;
                }
            }
        }
    }
    return handle;
}

static KI2CStatus hal_i2c_hw_init(hal_i2c_handle * handle)
{
    I2C_HandleTypeDef * hi2c;
    uint32_t freqrange = 0;
    uint32_t pclk1 = 0;

    if(handle == NULL)
    {
        return I2C_ERROR_NULL_HANDLE;
    }

    hi2c = &(handle->hal_handle);

    /* Allocate lock resource and initialize it */
    hi2c->Lock = HAL_UNLOCKED;
    /* Init the low level hardware : GPIO, CLOCK, NVIC */
    hal_i2c_msp_init(handle);

    /* Disable the selected I2C peripheral */
    __HAL_I2C_DISABLE(hi2c);

    /* Get PCLK1 frequency */
    pclk1 = HAL_RCC_GetPCLK1Freq();

