kubos/kubos/hal/kubos-hal-stm32f4/source/i2c.c
    /* Calculate frequency range */
    freqrange = I2C_FREQRANGE(pclk1);

    /*---------------------------- I2Cx CR2 Configuration ----------------------*/
    /* Configure I2Cx: Frequency range */
    hi2c->Instance->CR2 = freqrange;

    /*---------------------------- I2Cx TRISE Configuration --------------------*/
    /* Configure I2Cx: Rise Time */
    hi2c->Instance->TRISE = I2C_RISE_TIME(freqrange, hi2c->Init.ClockSpeed);

    /*---------------------------- I2Cx CCR Configuration ----------------------*/
    /* Configure I2Cx: Speed */
    hi2c->Instance->CCR = I2C_SPEED(pclk1, hi2c->Init.ClockSpeed, hi2c->Init.DutyCycle);

    /*---------------------------- I2Cx CR1 Configuration ----------------------*/
    /* Configure I2Cx: Generalcall and NoStretch mode */
    hi2c->Instance->CR1 = (hi2c->Init.GeneralCallMode | hi2c->Init.NoStretchMode);

    /*---------------------------- I2Cx OAR1 Configuration ---------------------*/
    /* Configure I2Cx: Own Address1 and addressing mode */
    hi2c->Instance->OAR1 = (hi2c->Init.AddressingMode | hi2c->Init.OwnAddress1);

    /*---------------------------- I2Cx OAR2 Configuration ---------------------*/
    /* Configure I2Cx: Dual mode and Own Address2 */
    hi2c->Instance->OAR2 = (hi2c->Init.DualAddressMode | hi2c->Init.OwnAddress2);

    /* Enable the selected I2C peripheral */
    __HAL_I2C_ENABLE(hi2c);

    return I2C_OK;
}

static void hal_i2c_msp_init(hal_i2c_handle * handle)
{
    GPIO_InitTypeDef  GPIO_InitStruct;

    /*##-1- Enable GPIO Clocks #################################################*/
    /* Enable GPIO clock */
    switch(handle->ki2c->bus_num)
    {
#ifdef YOTTA_CFG_HARDWARE_I2C_I2C1
        case K_I2C1:
        {
            __HAL_RCC_GPIOB_CLK_ENABLE();
            break;
        }
#endif
#ifdef YOTTA_CFG_HARDWARE_I2C_I2C2
        case K_I2C2:
        {
            __HAL_RCC_GPIOB_CLK_ENABLE();
            break;
        }
#endif
    }

    /*##-2- Configure peripheral GPIO ##########################################*/
    /* I2C SCL TX GPIO pin configuration  */
    GPIO_InitStruct.Pin       = handle->pins.scl;
    GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull      = GPIO_NOPULL;
    GPIO_InitStruct.Speed     = GPIO_SPEED_MEDIUM;
    GPIO_InitStruct.Alternate = handle->pins.alt;
    HAL_GPIO_Init(handle->pins.gpio_port, &GPIO_InitStruct);

    /* I2C SDA RX GPIO pin configuration  */
    GPIO_InitStruct.Pin       = handle->pins.sda;
    GPIO_InitStruct.Mode      = GPIO_MODE_AF_OD;
    GPIO_InitStruct.Pull      = GPIO_PULLUP;
    GPIO_InitStruct.Alternate = handle->pins.alt;
    HAL_GPIO_Init(handle->pins.gpio_port, &GPIO_InitStruct);

    /*##-3- Enable I2C peripherals Clock #######################################*/
    /* Enable I2C1 clock */
    switch(handle->ki2c->bus_num)
    {
#ifdef YOTTA_CFG_HARDWARE_I2C_I2C1
        case K_I2C1:
        {
            __HAL_RCC_I2C1_CLK_ENABLE();
            break;
        }
#endif
#ifdef YOTTA_CFG_HARDWARE_I2C_I2C2
        case K_I2C2:
        {
            __HAL_RCC_I2C2_CLK_ENABLE();
            break;
        }
#endif
    }

    /*##-4- Configure the NVIC for I2C #########################################*/
    /* NVIC for I2C1 */
    HAL_NVIC_SetPriority(handle->pins.er_irqn, 1, 0);
    HAL_NVIC_EnableIRQ(handle->pins.er_irqn);
    HAL_NVIC_SetPriority(handle->pins.ev_irqn, 2, 0);
    HAL_NVIC_EnableIRQ(handle->pins.ev_irqn);
}

static void hal_i2c_terminate(hal_i2c_handle * handle)
{
  /*##-1- Reset peripherals ##################################################*/
  switch(handle->ki2c->bus_num)
  {
#ifdef YOTTA_CFG_HARDWARE_I2C_I2C1
      case K_I2C1:
      {
          __HAL_RCC_I2C1_FORCE_RESET();
          __HAL_RCC_I2C1_RELEASE_RESET();
          break;
      }
#endif
#ifdef YOTTA_CFG_HARDWARE_I2C_I2C2
      case K_I2C2:
      {
          __HAL_RCC_I2C2_FORCE_RESET();
          __HAL_RCC_I2C2_RELEASE_RESET();
          break;
      }
#endif
  }

  /*##-2- Disable peripherals and GPIO Clocks ################################*/
  /* Configure I2C Tx as alternate function  */
  HAL_GPIO_DeInit(handle->pins.gpio_port, handle->pins.scl);
  /* Configure I2C Rx as alternate function  */
  HAL_GPIO_DeInit(handle->pins.gpio_port, handle->pins.sda);

  /*##-3- Disable the NVIC for I2C ###########################################*/
  HAL_NVIC_DisableIRQ(handle->pins.er_irqn);
  HAL_NVIC_DisableIRQ(handle->pins.ev_irqn);
}

static KI2CStatus hal_i2c_check_addr_timeout(I2C_HandleTypeDef * handle, uint32_t flag)
{
    KI2CStatus ret = hal_i2c_check_flag_timeout(handle, flag, RESET);
    switch(ret)
    {
        case I2C_OK: return I2C_OK;
        case I2C_ERROR_TIMEOUT: return I2C_ERROR_ADDR_TIMEOUT;
        default: return ret;
    }
}

static KI2CStatus hal_i2c_check_btf_timeout(I2C_HandleTypeDef * handle)
{
    KI2CStatus ret = hal_i2c_check_flag_timeout(handle, I2C_FLAG_BTF, RESET);
    switch(ret)
    {
        case I2C_OK: return I2C_OK;
        case I2C_ERROR_TIMEOUT: return I2C_ERROR_BTF_TIMEOUT;
        default: return ret;
    }
}

static KI2CStatus hal_i2c_check_txe_timeout(I2C_HandleTypeDef * handle)
{
    KI2CStatus ret = hal_i2c_check_flag_timeout(handle, I2C_FLAG_TXE, RESET);
    switch(ret)
    {
        case I2C_OK: return I2C_OK;
        case I2C_ERROR_TIMEOUT: return I2C_ERROR_TXE_TIMEOUT;
        default: return ret;
    }
}

static KI2CStatus hal_i2c_check_flag_special(I2C_HandleTypeDef * handle, uint32_t flag)
{
    if ((flag == I2C_FLAG_BTF) || (flag == I2C_FLAG_TXE))
    {
        /* Check for NACK */
        if (__HAL_I2C_GET_FLAG(handle, I2C_FLAG_AF) == SET)
        {
            __HAL_I2C_CLEAR_FLAG(handle, I2C_FLAG_AF);
            return I2C_ERROR_NACK;
        }
    }
    else if (flag == I2C_FLAG_ADDR)
    {
        if (__HAL_I2C_GET_FLAG(handle, I2C_FLAG_AF) == SET)
        {
            /* Generate Stop */
            handle->Instance->CR1 |= I2C_CR1_STOP;

            /* Clear AF */
            __HAL_I2C_CLEAR_FLAG(handle, I2C_FLAG_AF);

            return I2C_ERROR_AF;
        }
    }
    return I2C_OK;
}

