kubos/kubos/hal/kubos-hal-stm32f4/source/i2c.c
static KI2CStatus hal_i2c_check_flag_timeout(I2C_HandleTypeDef * handle, uint32_t flag, uint16_t status)
{
    uint16_t count = 0;
    KI2CStatus ret;

    while((__HAL_I2C_GET_FLAG(handle, flag) ? SET : RESET) == status)
    {
        if ((ret = hal_i2c_check_flag_special(handle, flag)) != I2C_OK)
        {
            return ret;
        }
        if (count >= FLAG_CHECK_TIMEOUT)
        {
            return I2C_ERROR_TIMEOUT;
        }
        count++;
        vTaskDelay(5);
    }
    return I2C_OK;
}


static KI2CStatus hal_i2c_master_request_read(I2C_HandleTypeDef * hal_handle, uint16_t addr)
{
    KI2CStatus ret = I2C_OK;

    /* Enable Acknowledge */
    hal_handle->Instance->CR1 |= I2C_CR1_ACK;

    /* Generate Start */
    hal_handle->Instance->CR1 |= I2C_CR1_START;

    /* Wait for SB */
    if ((ret = hal_i2c_check_flag_timeout(hal_handle, I2C_FLAG_SB, RESET)) != I2C_OK)
    {
        return ret;
    }
    /* Send slave address */
    if(hal_handle->Init.AddressingMode == K_ADDRESSINGMODE_7BIT)
    {
        /* Send slave address */
        hal_handle->Instance->DR = I2C_7BIT_ADD_READ(addr);
    }
    else if(hal_handle->Init.AddressingMode == K_ADDRESSINGMODE_10BIT)
    {
        /* Send header of slave address */
        hal_handle->Instance->DR = I2C_10BIT_HEADER_WRITE(addr);

        /* Wait until ADD10 flag is set */
        if((ret = hal_i2c_check_addr_timeout(hal_handle, I2C_FLAG_ADD10)) != I2C_OK)
        {
          return ret;
        }

        /* Send slave address */
        hal_handle->Instance->DR = I2C_10BIT_ADDRESS(addr);

        /* Wait until ADDR flag is set */
        if((ret = hal_i2c_check_addr_timeout(hal_handle, I2C_FLAG_ADDR)) != I2C_OK)
        {
          return ret;
        }

        /* Clear ADDR flag */
        __HAL_I2C_CLEAR_ADDRFLAG(hal_handle);

        /* Generate Restart */
        hal_handle->Instance->CR1 |= I2C_CR1_START;

        /* Wait until SB flag is set */
        if((ret = hal_i2c_check_flag_timeout(hal_handle, I2C_FLAG_SB, RESET)) != I2C_OK)
        {
          return ret;
        }

        /* Send header of slave address */
        hal_handle->Instance->DR = I2C_10BIT_HEADER_READ(addr);
    }
    else
    {
        //Bad addressing mode
        return I2C_ERROR;
    }

    /* Wait for ADDR */
    ret = hal_i2c_check_addr_timeout(hal_handle, I2C_FLAG_ADDR);

    return ret;
}

static KI2CStatus hal_i2c_master_setup_read(I2C_HandleTypeDef * hal_handle, uint16_t addr, int len)
{
    KI2CStatus ret = I2C_OK;
    // I2C_7BIT_ADD_READ expects an address already shifted
    uint16_t slave_addr = addr << 1;

    /* Check if I2C Busy */
    if ((ret = hal_i2c_check_flag_timeout(hal_handle, I2C_FLAG_BUSY, SET)) != I2C_OK)
    {
        return ret;
    }
    /* Disable pos */
    hal_handle->Instance->CR1 &= ~I2C_CR1_POS;

    /* Send Slave Address */
    if (( ret = hal_i2c_master_request_read(hal_handle, slave_addr)) != I2C_OK)
    {
        return ret;
    }
    switch(len)
    {
        case 0:
        {
            /* Clear ADDR */
            __HAL_I2C_CLEAR_ADDRFLAG(hal_handle);

            /* Generate Stop */
            hal_handle->Instance->CR1 |= I2C_CR1_STOP;
            break;
        }
        case 1:
        {
            /* Disable Acknowledge */
            hal_handle->Instance->CR1 &= ~I2C_CR1_ACK;

            /* Clear ADDR */
            __HAL_I2C_CLEAR_ADDRFLAG(hal_handle);

            /* Generate Stop */
            hal_handle->Instance->CR1 |= I2C_CR1_STOP;
            break;
        }
        case 2:
        {
            /* Disable Acknowledge */
            hal_handle->Instance->CR1 &= ~I2C_CR1_ACK;

            /* Enable POS */
            hal_handle->Instance->CR1 |= I2C_CR1_POS;

            /* Clear ADDR */
            __HAL_I2C_CLEAR_ADDRFLAG(hal_handle);
            break;
        }
        default:
        {
            /* Enable Acknowledge */
            hal_handle->Instance->CR1 |= I2C_CR1_ACK;

            /* Clear ADDR */
            __HAL_I2C_CLEAR_ADDRFLAG(hal_handle);
            break;
        }
    }

    return ret;
}


static KI2CStatus hal_i2c_master_request_write(I2C_HandleTypeDef * hal_handle, uint16_t addr)
{
    KI2CStatus ret = I2C_OK;

    /* Generate Start */
    hal_handle->Instance->CR1 |= I2C_CR1_START;

    /* Wait for SB */
    if ((ret = hal_i2c_check_flag_timeout(hal_handle, I2C_FLAG_SB, RESET)) != I2C_OK)
    {
        return ret;
    }

    /* Send slave address */
    if(hal_handle->Init.AddressingMode == K_ADDRESSINGMODE_7BIT)
    {
        /* Send slave address */
    	hal_handle->Instance->DR = I2C_7BIT_ADD_WRITE(addr);
    }
    else if(hal_handle->Init.AddressingMode == K_ADDRESSINGMODE_10BIT)
    {
        /* Send header of slave address */
    	hal_handle->Instance->DR = I2C_10BIT_HEADER_WRITE(addr);

        /* Wait until ADD10 flag is set */
        if((ret = hal_i2c_check_addr_timeout(hal_handle, I2C_FLAG_ADD10)) != HAL_OK)
        {
        	return ret;
        }

        /* Send slave address */
        hal_handle->Instance->DR = I2C_10BIT_ADDRESS(addr);
    }
    else
    {
    	//Bad addressing mode
    	return I2C_ERROR;
    }

    /* Wait for ADDR */
    ret = hal_i2c_check_addr_timeout(hal_handle, I2C_FLAG_ADDR);

    return ret;
}

static KI2CStatus hal_i2c_master_setup_write(I2C_HandleTypeDef * hal_handle, uint16_t addr)
{
    KI2CStatus ret = I2C_OK;
    // I2C_7BIT_ADD_WRITE expects address already shifted
    uint16_t slave_addr = addr << 1;

    /* Check if I2C is busy */
    if ((ret = hal_i2c_check_flag_timeout(hal_handle, I2C_FLAG_BUSY, SET)) != I2C_OK)
    {
        return ret;
    }
    /* Disable Pos */
    hal_handle->Instance->CR1 &= ~I2C_CR1_POS;

    /* Send Slave Address */
    ret = hal_i2c_master_request_write(hal_handle, slave_addr);

    if (ret == I2C_OK)
    {
        /* Clear ADDR flag */
        __HAL_I2C_CLEAR_ADDRFLAG(hal_handle);
    }

    return ret;
}

#endif

/* @} */
